Repository: bit-part/craftcms_docs-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: Press CMD + SHIFT + . (command + shift + period) to see them before moving them to another folder.
ja: 別のフォルダへ移動する前にそれらを表示するには、CMD + SHIFT + .（command + shift + ピリオド）を押してください。

source: Prevents the {% cache %} tag from activating if a certain condition is met.
ja: ある条件が満たされる場合、{% cache %} タグが作動しないようにします。

source: Previous/Next Page Links
ja: 前 / 次のページリンク

source: Primary Plugin Class
ja: プライマリプラグインクラス

source: Primary Site
ja: プライマリサイト

source: Processes a string with Markdown.
ja: Markdown で文字列を処理します。

source: Propagating Entries Across All Enabled Sites
ja: すべての有効サイトにエントリを広げる

source: Public Registration
ja: 一般登録

source: Publish a draft
ja: ドラフトの公開

source: Publish a draft (Craft Client or Craft Pro required)
ja: ドラフトの公開（Craft Client または Craft Pro が必要）

source: Publishing to the Plugin Store
ja: プラグインストアでの配布

source: Put a blank line before return statements.
ja: return 文の前に空白行を置いてください。

source: Quality - the transform’s resulting image quality (0 to 100)
ja: 品質 - 変換結果の画像品質（0 から 100）

source: Query Methods
ja: クエリメソッド

source: Query Params
ja: クエリパラメータ

source: Query condition
ja: クエリの条件

source: Queue Component
ja: Queue コンポーネント

source: RSS Feed
ja: RSS フィード

source: Radio Button Options – Define the radio buttons that will be available in the field.
ja: ラジオボタンのオプション – フィールドで利用可能なラジオボタンを定義します。

source: Radio Buttons Fields
ja: ラジオボタンフィールド

source: Radio Buttons fields give you a group of radio buttons.
ja: ラジオボタンフィールドでは、ラジオボタンのグループが提供されます。

source: Radio Buttons fields have the following settings:
ja: ラジオボタンフィールドの設定は、次の通りです。

source: Radio Buttons fields will show a radio group with each of the Radio Button Options as defined in the field settings:
ja: ラジオボタンフィールドでは、フィールド設定で定義されたラジオボタンのオプションがラジオグループとして表示されます。

source: Radio Buttons
ja: ラジオボタン

source: Randomizes the order of the elements within an array.
ja: 配列内のエレメントの順序をランダム化します。

source: Rather than raw data, they return element models.
ja: 生データでなく、エレメントモデルを返します。

source: Rather than requiring that everyone upload images at a certain size, Craft lets you define “image transforms”, which set those rules on Craft’s end instead.
ja: すべての人に実サイズの画像アップロードを要求するのではなく、Craft が代わりにどう処理するかのルールをセットした「画像の変形」を定義することができます。

source: Rather than typing “entry.assetsFieldHandle” every time, you can call it once and set it to another variable:
ja: 常に「entry.assetsFieldHandle」を記述するよりもむしろ、一度呼び出して別の変数にセットしましょう。

source: Rather than typing “entry.categoriesFieldHandle” every time, you can call it once and set it to another variable:
ja: 常に「entry.categoriesFieldHandle」を記述するよりもむしろ、一度呼び出して別の変数にセットしましょう。

source: Rather than typing “entry.entriesFieldHandle” every time, you can call it once and set it to another variable:
ja: 常に「entry.entriesFieldHandle」を記述するよりもむしろ、一度呼び出して別の変数にセットしましょう。

source: Rather than typing “entry.tagsFieldHandle” every time, you can call it once and set it to another variable:
ja: 常に「entry.tagsFieldHandle」を記述するよりもむしろ、一度呼び出して別の変数にセットしましょう。

source: Rather than typing “entry.usersFieldHandle” every time, you can call it once and set it to another variable:
ja: 常に「entry.usersFieldHandle」を記述するよりもむしろ、一度呼び出して別の変数にセットしましょう。

source: Rather, take it in the spirit in which it’s intended - a guide to make it easier to enrich all of us and the technical communities in which we participate.
ja: むしろ、意図している「わたしたち自身や参加する技術的なコミュニティのすべてをより豊かにするためのガイドである」という精神を取り入れてください。

source: Readme for the craftcms/craft repo.
ja: craftcms/craft リポジトリの README ファイルです。

source: Rebuilding your Search Indexes
ja: 検索インデックスの再構築

source: Recipe Content (ingredients and instructions)
ja: レシピのコンテンツ（材料と作り方）

source: Recipe Image
ja: レシピ画像

source: Recipe Snapshot (short description)
ja: レシピのスナップショット（簡単な説明）

source: Redactor Configs
ja: Redactor 設定

source: Reference Tags
ja: リファレンスタグ

source: Reference tags can be used to create references to various elements in your site.
ja: リファレンスタグを利用して、サイト内の様々なエレメントへの参照を作成できます。

source: Relations
ja: リレーション

source: Remember that we’re a world-wide community, so you might not be communicating in someone else’s primary language.
ja: 世界的なコミュニティのため、あなたが他の誰かにとっての主要な言語で伝えられていないかもしれないことを覚えておきましょう。

source: Remember that we’re different.
ja: わたしたちは同じではないことを忘れないでください。

source: Remote Environments
ja: リモート環境

source: Remote Volumes
ja: リモートボリューム

source: Remove
ja: 削除

source: Removes any empty elements from an array and returns the modified array.
ja: 配列から空のエレメントを削除し、変更された配列を返します。

source: Rename files
ja: ファイルのリネーム

source: Rename subfolders
ja: サブフォルダのリネーム

source: Repeated harassment of others.
ja: 他の人に嫌がらせを繰り返すこと。

source: Replace ns\prefix with your plugin’s namespace prefix.
ja: ns\prefix を実際のプラグインの名前空間接頭辞に置き換えてください。

source: Replace:
ja: 次の項目を置き換えてください。

source: Replaces parts of a string with other things.
ja: 文字列の一部を他のものに置き換えます。

source: Request Params
ja: リクエストパラメータ

source: Required Database User Privileges
ja: 必要なデータベースユーザー特権

source: Required PHP Extensions
ja: 必要な PHP エクステンション

source: Resources:
ja: リソース：

source: Restrict allowed file types? Whether the field should only be able to select/upload files of a certain type(s)
ja: 許可されるファイルの種類を制限しますか？ 特定の種類のファイルだけを選択・アップロードできるフィールドにするかどうか

source: Restrict uploads to a single folder? – Whether file uploads/selections should be constrained to a single folder
ja: アップロードを単一のフォルダに限定しますか？ – ファイルのアップロード・選択を単一のフォルダに制限するかどうか

source: Restricting Allowed File Types
ja: 許可されるファイルの種類を制限

source: Restricting Uploads to a Single Folder
ja: アップロードを単一のフォルダに限定

source: Returns a URL to a page on your site.
ja: サイトのページへの URL を返します。

source: Returns a hidden CSRF Token input.
ja: 不可視の CSRF トークン入力欄を返します。

source: Returns a string formatted in “PascalCase” (AKA “UpperCamelCase”).
ja: 「PascalCase」（別名「UpperCamelCase」）でフォーマットされた文字列を返します。

source: Returns a string formatted in “camelCase”.
ja: 「camelCase」でフォーマットされた文字列を返します。

source: Returns a string formatted in “kebab-case”.
ja: 「kebab-case」でフォーマットされた文字列を返します。

source: Returns a string formatted in “snake_case”.
ja: 「snake_case」でフォーマットされた文字列を返します。

source: Returns all of the elements in an array.
ja: 配列内のすべてのエレメントを返します。

source: Returns an array containing only the values that are also in a passed-in array.
ja: 渡された配列内にある値だけを含む配列を返します。

source: Returns an array of all the first column’s values.
ja: すべての配列の最初のカラム値を返します。

source: Returns an array of all the values in a given array, but without any custom keys.
ja: 指定された配列のすべての値の配列を返しますが、カスタムキーは除かれます。

source: Returns an array of the IDs of the matching elements.
ja: マッチしたエレメントの ID の配列を返します。

source: Returns an array without the specified element(s).
ja: 指定されたエレメントを除いた配列を返します。

source: Returns the nth matching element, or null if there isn’t one.
ja: マッチした n 番目のエレメントを返します。存在しない場合、null を返します。

source: Returns the contents of a given SVG file.
ja: 指定された SVG ファイルのコンテンツを返します。

source: Returns the first column’s value of the first matching element.
ja: 最初にマッチしたエレメントの最初のカラム値を返します。

source: Returns the first matching element, or null if there isn’t one.
ja: 最初にマッチするエレメントを返します。存在しない場合、null を返します。

source: Returns the fully qualified class name of a given object.
ja: 指定されたオブジェクトの完全修飾クラス名を返します。

source: Returns the index of a passed-in value within an array, or the position of a passed-in string within another string.
ja: 配列内の渡された値のインデックス、または、他の文字列に含まれる渡された文字列のインデックスを返します。

source: Returns the total number of elements that are matched by the query.
ja: クエリにマッチしたエレメントの総数を返します。

source: Returns the value of an environment variable.
ja: 環境変数の値を返します。

source: Returns whether a given object is an instance of , an interface used to represent components whose types are missing.
ja: 指定されたオブジェクトが のインスタンスかどうかを返します。型が見つからないコンポーネントを表すために使用されるインターフェースです。

source: Returns whether a given object is an instance of MissingComponentInterface, an interface used to represent components whose types are missing.
ja: 指定されたオブジェクトが MissingComponentInterface のインスタンスかどうかを返します。型が見つからないコンポーネントを表すために使用されるインターフェースです。

source: Returns whether an object is an instance of another object or class.
ja: オブジェクトが別のオブジェクトまたはクラスのインスタンスかどうかを返します。

source: Returns whether any elements match the query.
ja: クエリにマッチするエレメントがあるかどうかを返します。

source: Review the requirements below or use the Craft Server Check script to quickly check whether you meet the requirements.
ja: 以下の要件を再確認してください。または、要件を満たすかどうかを素早くチェックできる Craft Server Check スクリプトを使ってください。

source: Rich Text Fields
ja: リッチテキストフィールド

source: Rounds a number down.
ja: 整数値に切り捨てます。

source: Rounds a number up.
ja: 整数値に切り上げます。

source: Rounds off a number to the closest integer.
ja: 最も近い整数値に数を丸めます。

source: Routes in config/routes.php generally follow this syntax:
ja: config/routes.php のルートは、一般的に次のような構文になります。

source: Routes in craft/config/routes.php generally follow this syntax:
ja: craft/config/routes.php のルートは、一般的に次のような構文になります。

source: Routing
ja: ルーティング

source: Routing helps Craft smartly handle requests to your site.
ja: ルーティングは、Craft がサイトのリクエストをスマートに処理するのに役立ちます。

source: Run the following command to load Craft 3 (this will take a few minutes):
ja: Craft 3 を読み込むための次のコマンドを実行してください。（これは数分かかります）

source: Run the installer!
ja: インストーラの実行

source: Runs a DateInterval object through
ja: DateInterval オブジェクトに を実行します。

source: Runs a `DateInterval` object through craft\helpers\DateTimeHelper::humanDurationFromInterval()
ja: `DateInterval` オブジェクトに craft\helpers\DateTimeHelper::humanDurationFromInterval() を実行します。

source: Runs a string through
ja: 文字列に を実行します。

source: Runs a string through craft\helpers\Db::escapeParam
ja: 文字列に craft\helpers\Db::escapeParam を実行します。

source: Runs an array through .
ja: 配列に を実行します。

source: Runs an array through ArrayHelper::getColumn() and returns the result.
ja: 配列に ArrayHelper::getColumn() を実行し、その結果を返します。

source: Runs an array through ArrayHelper::index().
ja: 配列に ArrayHelper::index() を実行します。

source: Runs an array through array_unique().
ja: 配列に array_unique() を実行します。

source: Runs an array through craft\helpers\ArrayHelper::filterByValue().
ja: 配列に craft\helpers\ArrayHelper::filterByValue() を実行します。

source: Safari 9.0 or later
ja: Safari 9.0 以降

source: Save a new draft of the entry
ja: エントリの新しいドラフトの保存

source: Save a new draft of the entry (Craft Client or Craft Pro required)
ja: エントリの新しいドラフトの保存（Craft Client または Craft Pro が必要）

source: Save changes to the entry
ja: エントリの変更を保存

source: Save the new site.
ja: 新しいサイトを保存します。

source: Save the volume
ja: ボリュームを保存します。

source: Scroll down through the agreement (reading it all, of course) and click the “Got it” button to accept.
ja: （もちろん、すべて目を通した上で）契約をスクロールダウンし、「Got it（了解）」ボタンをクリックして了承してください。

source: Scroll down through the agreement (reading it all, of course) and tap or click "Got it" to accept.
ja: （もちろん、すべて目を通した上で）契約をスクロールダウンし、「Got it（了解）」ボタンをタップまたはクリックして了承してください。

source: Search Bar
ja: 検索バー

source: Search Form
ja: 検索フォーム

source: Searching
ja: 検索

source: Searching for specific element attributes
ja: 特定エレメントの属性を検索する

source: Searching for… | will find elements… -|- salty | containing “salty”.
ja: この検索によって | こちらのエレメントが見つかるでしょう -|- salty | 「salty」という単語を含んでいる

source: Section Types
ja: セクションタイプ

source: Sections
ja: セクション

source: Sections and Entries
ja: セクションとエントリ

source: Sections are how we organize our content or data in Craft.
ja: セクションは、Craft のコンテンツやデータを整理するための手段です。

source: See Asset Bundles
ja: アセットバンドルを見てください

source: See Directory Structure for information on these directories and files.
ja: これらのディレクトリやファイルに関する情報はディレクトリ構造を見てください。

source: See Image Transforms for more information.
ja: 詳細については、画像の変形を参照してください。

source: See Updating Plugins for Craft 3.
ja: Craft 3 のためのプラグインアップデートを参照してください。

source: See here for a list of the possible numberOptions.
ja: 利用可能な numberOptions は、こちらのリストを参照してください。

source: See here for a list of the possible textOptions.
ja: 利用可能な textOptions は、こちらのリスト を参照してください。

source: See Enabling Fuzzy Search by Default for more info.
ja: 詳細については、 Enabling Fuzzy Search by Default を参照してください。

source: See Guzzle’s documentation for a list of available options.
ja: 利用可能なオプションのリストは、Guzzle のドキュメントを参照してください。

source: See Also
ja: 関連項目

source: See our Search Form tutorial for a complete example of listing dynamic search results.
ja: 動的な検索結果をリスト化する完全な例については、検索フォームチュートリアルを参照してください。

source: See our Localization Guide for more details.
ja: 詳細については、ローカライゼーションガイドを参照してください。

source: Selecting a field is as simple as dragging it from the bottom area to the top, positioning it wherever you want alongside the other selected fields.
ja: フィールドの選択は下のエリアから上にドラッグするだけの簡単な操作で、すでに配置されたフィールドの前後の好きな場所に配置できます。

source: Selection Label – The label that should be used on the field’s selection button.
ja: 選択ラベル – フィールドの選択ボタンのラベルに使用されます

source: Selection Label – The label that should be used on the field’s tag search input.
ja: 選択ラベル – タグの検索と入力を行うフィールドのラベルに使用されます

source: Send a link to this page to your server administrator.
ja: このページのリンクをサーバー管理者に送ってください。

source: Server Requirements
ja: サーバー要件

source: Services
ja: サービス

source: Set minimum-stability to "dev"
ja: minimum-stability を "dev" に設定します。

source: Set prefer-stable to true
ja: prefer-stable を true に設定します。

source: Set DB_TABLE_PREFIX="craft" if that’s what your tables are currently prefixed with.
ja: 現在のテーブル接頭辞がそれである場合、DB_TABLE_PREFIX="craft" をセットしてください。

source: Set DB_TABLE_PREFIX="craft_" if that’s what your tables are currently prefixed with.
ja: テーブルの現在の接頭辞がそれである場合、DB_TABLE_PREFIX="craft_" をセットしてください。

source: Set Password Form
ja: パスワードの設定フォーム

source: Set the field property if you want to limit the scope to relations created by a particular field.
ja: 特定のフィールドで作成されたリレーションにスコープを制限する場合、field プロパティをセットします。

source: Set the sourceLocale property if you want to limit the scope to relations created from a particular field (Only do this if you set your relational field to be translatable.).
ja: 特定のフィールドで作成されたリレーションにスコープを制限する場合、sourceLocale プロパティをセットします（関連フィールドを翻訳可能に設定している場合のみ）。

source: Set the sourceLocale property if you want to limit the scope to relations created from a particular field.
ja: 特定のフィールドで作成されたリレーションにスコープを制限する場合は、sourceLocale プロパティをセットします。

source: Set the Key Manually
ja: キーを手動で設定

source: Set the Key from Your Terminal
ja: キーをターミナルから設定

source: Set the correct URL setting for the folder
ja: フォルダに対応する正しい「ベース URL」を設定します。

source: Set the first property’s key depending on what you want to get back:
ja: 最初のプロパティのキーは、取得したいものにあわせてセットしてください。

source: Set up the Database
ja: データベースのセットアップ

source: Set up the Web Server
ja: ウェブサーバーのセットアップ

source: Sets the authorGroupId param based on a given user group(s)’s handle(s)
ja: 指定されたユーザーグループのハンドルに基づき、authorGroupId パラメータをセット

source: Sets the groupId param based on a given category group(s)’s handle(s)
ja: 指定されたカテゴリグループのハンドルに基づき、groupId パラメータをセット

source: Sets the groupId param based on a given tag group(s)’s handle(s)
ja: 指定されたタググループのハンドルに基づき、groupId パラメータをセット

source: Sets the ownerId and ownerSiteId params based on a given element
ja: 指定されたエレメントに基づき、ownerId と ownerSiteId パラメータをセット

source: Sets the ownerLocale param
ja: ownerLocale パラメータをセット

source: Sets the ownerSiteId param based on a given site(s)’s handle(s)
ja: 指定されたサイトのハンドルに基づき、ownerSiteId パラメータをセット

source: Sets the postDate param to only allow entries whose Post Date is after the given value
ja: 指定した投稿日以降のエントリだけを許可するよう postDate パラメータをセット

source: Sets the postDate param to only allow entries whose Post Date is before the given value
ja: 指定した投稿日以前のエントリだけを許可するよう postDate パラメータをセット

source: Sets the sectionId param based on a given section(s)’s handle(s)
ja: 指定されたセクションのハンドルに基づき、sectionId パラメータをセット

source: Sets the siteId param based on a given site(s)’s handle
ja: 指定されたサイトのハンドルに基づき、siteId パラメータをセットÍ

source: Sets the typeId param based on a given block type(s)’s handle(s)
ja: 指定されたブロックタイプのハンドルに基づき、typeId パラメータをセット

source: Sets the typeId param based on a given entry type(s)’s handle(s)
ja: 指定された入力タイプのハンドルに基づき、typeId パラメータをセット

source: Sets the volumeId param
ja: volumeId パラメータをセット

source: Sets the volumeId param based on a given volume(s)’s handle(s)
ja: 指定されたボリュームのハンドルに基づき、volumeId パラメータをセット

source: Setting
ja: 設定

source: Setting Parameters
ja: パラメータの設定

source: Setting Params to Arrays
ja: パラメータを配列にセットする

source: Setting Up the Database
ja: データベースのセットアップ

source: Setting up the basic file structure
ja: 基本ファイル構成の設定

source: Settings
ja: 設定

source: Setup from the Command Line
ja: コマンドラインからのセットアップ

source: Shortcut for createCommand()->getRawSql()
ja: createCommand()->getRawSql() のショートカット

source: Shortcut for typing <input type="hidden" name="redirect" value="{{ url|hash }}">.
ja: <input type="hidden" name="redirect" value="{{ url|hash }}"> を入力するためのショートカットです。

source: Should Craft handle this request in the first place?
ja: このリクエストを Craft が最初に処理するべきか？

source: Show the Title field? – Whether a Title field is displayed for entries of this type
ja: タイトルのフィールドの見る – この入力タイプのエントリでタイトルフィールドを表示するかどうか

source: Showing children
ja: 子エレメントの表示

source: Showing the elements
ja: エレメントの表示

source: Similar to Field Groups, Site Groups are for organization only.
ja: フィールドグループに似ていて、サイトグループは整理するためだけにあります。

source: Similarly, the usePathInfo setting can no longer be set to 'auto' either.
ja: 同様に、usePathInfo 設定も 'auto' にすることはできません。

source: Since all of the conditionals are evaluating the same thing – matrixBlock.type – we can simplify that code using a {% switch %} tag instead:
ja: 条件文のすべてが同じもの – matrixBlock.type – を評価しているため、代わりに {% switch %} タグを利用してコードを簡略化できます。

source: Singles
ja: シングル

source: Singles are used for one-off pages that have unique content requirements, such as:
ja: シングルは、次のようなユニークなコンテンツを持つ1回限りのページで利用します。

source: Site Groups
ja: サイトグループ

source: Site Groups allow you to organize your sites together by commonality, like language or site type.
ja: サイトグループでは、言語や種類などの共通点によってサイトをひとまとめに整理できます。

source: Site URL
ja: サイト URL

source: Site URL and Local volume settings will automatically be converted to the new Alias syntax when updating to Craft 3 (@variable instead of {variable}).
ja: Craft 3 にアップデートすると、サイト URL やローカルボリュームの設定は新しいエイリアス構文 （{variable} の代わりに @variable）へ自動的に変換されます。

source: Sites
ja: サイト

source: Sites can all share the same domain name, such as https://craftcms.com and https//craftcms.com/beta, or they can have different domains, like https://www.craftcms.com and https://beta.craftcms.com .
ja: サイトは https://craftcms.com や https//craftcms.com/beta のように同じドメイン名をすべて共有したり、https://www.craftcms.com や https://beta.craftcms.com のように異なるドメインを持たせることができます。

source: Sites’ Base URL settings
ja: サイトのベース URL 設定

source: So one(), all(), and other element query methods are not available.
ja: そのため、one()、all()、またはその他のエレメントクエリのメソッドを利用することができません。

source: So any time you change anything in composer.json, such as your plugin’s dependency requirements or its plugin information, you will need to completely remove and re-require your plugin in your project for those changes to take effect.
ja: そのため、プラグインの依存要件やプラグインの情報のような composer.json 内の何かを変更するときはいつでも、それらの変化が効力を発揮するようプロジェクト内のあなたのプラグインを完全に削除して再要求する必要があります。

source: So don’t call all() on the object.
ja: そのため、オブジェクトの all() をコールしないでください。

source: So for example, if you have an image that is 600 by 400 pixels, and you set a transform’s Width to 60, but leave Height blank, the resulting height will be 40.
ja: 例えば、600 x 400 ピクセルの画像があり、変形の幅を 60 に設定し、高さを空白のままにした場合、変形した画像の高さは 40 になります。

source: So if your Matrix field is attached to an entry, and you want to output the entry ID in your dynamic subfolder path, you would type {owner.id} not just {id}.
ja: そのため、行列フィールドがエントリに紐づけられていて、動的なサブフォルダパスにエントリ ID を出力したい場合、{id} ではなく {owner.id} と記述します。

source: So if your files are set up like this:
ja: ファイルが次のようにセットアップされているとすれば

source: So something like this is possible:
ja: そのため、次のようなことが可能です。

source: So the number of queries needed will be N (the number of entries) + 1 (the initial entries query).
ja: そのため、必要なクエリの総数は N（エントリ数）+ 1（最初にエントリを取得するクエリ）となります。

source: So to begin, create a new directory alongside your current project, and follow steps 1-3 in the installation instructions.
ja: はじめに、既存のプロジェクトと並行する新しいディレクトリを作成し、インストールガイドのステップ 1 〜 3 に従ってください。

source: Some common usage examples in Craft:
ja: Craft の一般的な使用例です。

source: Some filters accept parameters::
ja: いくつかのフィルタは、パラメータを受け取ります。

source: Some of the folders you might find in there include:
ja: そこにはいくつかのフォルダが含まれます。

source: Some settings and functions in Craft support Yii aliases, which are basically placeholders for base file system paths and URLs.
ja: Craft のいくつかの設定やファンクションでは、基本ファイルシステムのパスや URL を代用する Yii エイリアスをサポートしています。

source: Sorts an array with ArrayHelper::multisort().
ja: ArrayHelper::multisort() で配列をソートします。

source: Source element - it has the relational field, where you selected the other element.
ja: ソースエレメント - 他のエレメントを選択した関連フィールドを持つもの

source: Source – The category group you want to relate categories from.
ja: ソース – カテゴリを関連付けるカテゴリグループ

source: Source – The tag group you want to relate tags from.
ja: ソース – タグを関連付けるタググループ

source: Sources – The user groups you want to relate users from.
ja: ソース – ユーザーを関連付けるユーザーグループ

source: Sources – Which asset sources the field should be able to select/upload files from
ja: ソース – ファイルの選択・アップロードを可能とするアセットソース

source: Sources – The sections you want to relate entries from.
ja: ソース – エントリを関連付けるセクション

source: Specifies the name of the key the cache should use.
ja: キャッシュが使用するキーの名前を指定します。

source: Standard MIT license, which covers all the code in the craftcms/craft repo, but NOT any Composer-installed libraries in the vendor/ folder.
ja: craftcms/craft リポジトリのすべてのコードをカバーするのは標準の MIT ライセンスですが、vendor/ フォルダの Composer がインストールしたライブラリはその限りではありません。

source: Static Translation Files
ja: 静的な翻訳ファイル

source: Status
ja: ステータス

source: Step 1: Create the Site in Settings
ja: ステップ 1：設定でサイトを作成

source: Step 1: Defining Your Sites and Languages
ja: ステップ 1：サイトと言語の定義

source: Step 1: Download Craft
ja: ステップ 1：Craft のダウンロード

source: Step 2: Create Template Directories
ja: ステップ 2：テンプレートディレクトリの作成

source: Step 2: Set the File Permissions
ja: ステップ 2：ファイルパーミッションの設定

source: Step 2: Update Your Sections
ja: ステップ 2：セクションのアップデート

source: Step 3: Define Your Translatable Fields
ja: ステップ 3：翻訳可能なフィールドの定義

source: Step 3: Set a Security Key
ja: ステップ 3：セキュリティキーの設定

source: Step 3: Update the Site Sections and Fields
ja: ステップ 3：サイトのセクションとフィールドのアップデート

source: Step 4: Create a Database
ja: ステップ 4：データベースの作成

source: Step 4: Define Translation Method of Fields
ja: ステップ 4：フィールドの翻訳方法の定義

source: Step 4: Update Your Templates
ja: ステップ 4：テンプレートのアップデート

source: Step 5: Give your authors access to the sites
ja: ステップ 5：投稿者にサイトへのアクセス権を付与

source: Step 5: Set up the Web Server
ja: ステップ 5：ウェブサーバーのセットアップ

source: Step 5: Test Your Settings
ja: ステップ 5：設定のテスト

source: Step 6: Check Your Asset Volumes Settings
ja: ステップ 6：アセットボリューム設定の確認

source: Step 6: Run the Setup Wizard
ja: ステップ 6：セットアップウィザードの実行

source: Step 7: Configure Your Web Server and DNS
ja: ステップ 7：ウェブサーバーと DNS の設定

source: Straight up Craft has some great articles on how to use Twig within Craft.
ja: Straight up Craft は、Craft での Twig の使い方に関する素晴らしい記事があります。

source: Stretch – Stretches the image to the specified width and height.
ja: ストレッチ – 指定された幅と高さに画像を伸張します。

source: Strings that are concatenated across multiple lines should have the . operator at the ends of lines.
ja: 複数行に渡って連結される文字列は、行の最後に . 演算子を付ける必要があります。

source: Structure sections may want to have nested paths for child entries:
ja: ストラクチャーセクションでは、子エントリのためのネストされたパスが必要かもしれません。

source: Structure sections may wish to have an Entry URI Format that differs depending on whether it’s a top-level entry or a nested one:
ja: ストラクチャーセクションでは、エントリがトップレベルかネストされているかによって、異なるエントリー URI 形式を持つことを望むかもしれません。

source: Structure sections might also want to include a segment before the nested path:
ja: ストラクチャーセクションでは、ネストされたパスの前にセグメントを含めることもできます。

source: Structures
ja: ストラクチャー
